tap "candid82/brew"
tap "clangen/musikcube"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "yqrashawn/goku"

# CLI Dependencies
brew "readline"
brew "rlwrap"
brew "expect"

# Processor
brew "angle-grinder"
brew "jq"

# Search
brew "fd"
brew "grep"
brew "ripgrep"
brew "the_silver_searcher"

# Editor
brew "neovim"

# Terminal Multiplexer
brew "tmux"
brew "screen"

# Shells
# brew "zsh"
# brew "bash"
# brew "fish"

# Essential Utilities
brew "bat"
brew "exa"
brew "fzf"
brew "tokei"

# Log Navigator
brew "lnav"
brew "less"

# Path Picker
brew "fpp"

# Download Manager
brew "aria2"
brew "wget"
brew "curl"

# Diff
brew "colordiff"
brew "diff-so-fancy"

# GNU Utilities
brew "coreutils"
brew "diffutils"
brew "findutils"

# Git Tools
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "tig"
brew "hub"
brew "gist"

# Runtime Version manager
brew "asdf", args: ["HEAD"]

# File Watcher
brew "entr"

# Cheatsheet
brew "cheat"
brew "tealdeer"

# Archive Extraction
brew "unrar"
brew "unzip"

# Utilities
brew "cliclick"
brew "htop"
brew "editorconfig"
brew "emojify"
brew "neofetch"
brew "openssh"

######################################

# cask "osxfuse"
# cask "xquartz"
# brew "ansifilter"
# brew "sqlite"
# brew "asciinema"
brew "automake"
# brew "bfg"
brew "blueutil"
brew "glib"
# brew "carthage"
# brew "circleci"
brew "cmake"
brew "cmatrix"
brew "pkg-config"
brew "unbound"
brew "harfbuzz"
brew "srt"
brew "ffmpeg"
# brew "cmus", link: false
# brew "cocoapods"
# brew "crystal"
# brew "deno"
brew "exiftool"
brew "fdupes"
brew "figlet"
brew "gdb"
brew "gh"
brew "ghc"
brew "gnupg"
# brew "go"
brew "graphviz"
brew "highlight"
brew "imagemagick"
brew "ldns"
brew "leiningen"
brew "libfido2"
brew "libpq"
brew "librsvg"
brew "libx11"
brew "libxml2"
brew "litecli"
# brew "luarocks"
# brew "mosh"
# brew "mycli"
# brew "pgcli"
# brew "poppler"
# brew "pulumi"
# brew "radare2"
# brew "redis"
# brew "ruby"
# brew "shellcheck"
# brew "shpotify"
# brew "socat"
# brew "spotifyd"
# brew "sshfs"
# brew "starship"
# brew "switchaudio-osx"
# brew "tcpdump"
# brew "terraform"
# brew "thefuck"
# brew "watchman"
# brew "websocat"
# brew "zlib"
# brew "clangen/musikcube/musikcube"
# brew "clojure/tools/clojure"
# brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-no-titlebar"]
# brew "koekeishiya/formulae/skhd"
# brew "koekeishiya/formulae/yabai"
# brew "railwaycat/emacsmacport/emacs-mac", args: ["with-imagemagick", "with-no-title-bars", "with-rsvg", "with-spacemacs-icon"], link: false
# brew "yqrashawn/goku/goku"

########### asdf deps ############
brew "gpg"
brew "gawk"

########### Brew Cask ############

# cask "adobe-creative-cloud"
# cask "airtable"
# cask "alacritty"
# cask "alfred"
# cask "audio-hijack"
# cask "basictex"
# cask "calibre"
# cask "charles"
# cask "cloudflare-warp"
# cask "contexts"
# cask "daisydisk"
# cask "dash"
# cask "discord"
# Wait M! supported
# cask "docker"
# cask "dropbox"
# cask "edex-ui"
# cask "fantastical"
# cask "figma"
# cask "firecamp"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
# cask "font-jetbrains-mono"
# cask "font-jetbrainsmono-nerd-font"
# cask "google-chrome"
# cask "google-cloud-sdk"
# cask "grammarly"
# cask "graphql-playground"
# cask "hammerspoon"
# cask "handbrake"
# cask "hey"
# cask "insomnia"
# cask "insomnia-designer"
cask "iterm2"
# cask "jetbrains-toolbox"
# cask "karabiner-elements"
# cask "keybase"
# cask "keyboard-maestro"
# cask "kindle"
# cask "kite"
# cask "kitty"
# cask "logitech-presentation"
# cask "loopback"
cask "microsoft-edge"
# cask "notion"
# cask "obsidian"
# cask "parallels"
# cask "pdf-expert"
# cask "phoenix"
cask "postman"
cask "responsively"
# cask "rocket"
# cask "setapp"
# cask "sf-symbols"
# cask "sizzy"
# cask "sketch"
# cask "skim"
# cask "slack"
# cask "smcfancontrol"
# cask "spotify"
# cask "steam"
# cask "synthesia"
# cask "telegram"
# cask "tex-live-utility"
# cask "transmission"
# cask "ubersicht"
# cask "vagrant"
# cask "vanilla"
# cask "vimr"
# cask "virtualbox"
cask "visual-studio-code"
# cask "vlc"
# cask "vmware-fusion"
# cask "vox"
# cask "webviewscreensaver"
# cask "wireshark"
# cask "zoomus"
cask "mysqlworkbench"
cask "fork"
cask "microsoft-teams"

# K8S IDE
cask "lens"

# VPN
# cask "tunnelblick"
cask "openvpn-connect"